In [263]:
import numpy as np
import pandas as pd

In [264]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [265]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [266]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [267]:
train = train.drop(columns='Name')
test = test.drop(columns='Name')

In [268]:
cols = [
    'Age',
    'Fare'
]
train[cols] = train[cols].fillna(train[cols].median())
test[cols] = test[cols].fillna(train[cols].median())

In [269]:
train['Deck'] = train['Cabin'].str[0]
test['Deck'] = train['Cabin'].str[0]


train['Deck'] = train['Deck'].fillna('U')
test['Deck'] = test['Deck'].fillna('U')

In [270]:
train['Embarked'] = train['Embarked'].fillna(train['Embarked'].mode()[0])

In [271]:
train = train.drop(columns='Cabin')
test = test.drop(columns='Cabin')

In [272]:
train['Sex'] = train['Sex'].map({'male':0, 'female':1})
test['Sex'] = test['Sex'].map({'male':0, 'female':1})

In [273]:
train = train.drop(columns='Ticket')
test = test.drop(columns='Ticket')

In [274]:
train = pd.get_dummies(train, columns=['Embarked', 'Deck'], drop_first=True)
test = pd.get_dummies(test, columns=['Embarked', 'Deck'], drop_first=True)

In [ ]:
dummy_cols = [col for col in train.columns if col.startswith('Embarked_') or col.startswith('Deck_')]
train[dummy_cols] = train[dummy_cols].astype(int)
test[dummy_cols] = test[dummy_cols].astype(int)

In [281]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_Q,Embarked_S,Deck_B,Deck_C,Deck_D,Deck_E,Deck_F,Deck_G,Deck_T,Deck_U
0,1,0,3,0,22.0,1,0,7.2500,0,1,0,0,0,0,0,0,0,1
1,2,1,1,1,38.0,1,0,71.2833,0,0,0,1,0,0,0,0,0,0
2,3,1,3,1,26.0,0,0,7.9250,0,1,0,0,0,0,0,0,0,1
3,4,1,1,1,35.0,1,0,53.1000,0,1,0,1,0,0,0,0,0,0
4,5,0,3,0,35.0,0,0,8.0500,0,1,0,0,0,0,0,0,0,1

In [280]:
test.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_Q,Embarked_S,Deck_B,Deck_C,Deck_D,Deck_E,Deck_F,Deck_G,Deck_T,Deck_U
0,892,3,0,34.5,0,0,7.8292,1,0,0,0,0,0,0,0,0,1
1,893,3,1,47.0,1,0,7.0000,0,1,0,1,0,0,0,0,0,0
2,894,2,0,62.0,0,0,9.6875,1,0,0,0,0,0,0,0,0,1
3,895,3,0,27.0,0,0,8.6625,0,1,0,1,0,0,0,0,0,0
4,896,3,1,22.0,1,1,12.2875,0,1,0,0,0,0,0,0,0,1